/*
 * 第八章: 异常控制流
 *
 * 摘要:
 *
 *
 *
 *
 *
 *-----------------------------------------------------------------------------------------------
 * 练习题8.1:
 * 考虑三个具有下述起始和结束时间的进程:
 *
 * 进程           起始时间         结束时间
 * A               0               2
 * B               1               4
 * C               3               5
 *
 * 对于对进程, 指出它们是否是并发运行的:
 *
 * 进程对          并发的?
 * AB              Y
 * AC              N
 * BC              Y
 *-----------------------------------------------------------------------------------------------
 * 练习题8.2:
 * 考虑下面程序:
 *
 * #include "csapp.h"
 * int main() {
 *   int x = 1;
 *   if (Fork() == 0) {
 *     printf("printf1: x = %d\n", ++x);
 *   }
 *   printf("printf2: x = %d\n", --x);
 *   exit(0);
 * }
 *
 * A. 子进程的输出是什么?
 *    子进程输出:
 *        printf1: x = 2
 *        printf2: x = 1
 * B. 父进程的输出是什么?
 *        printf2: x = 0
 *-----------------------------------------------------------------------------------------------
 * 练习题8.3:
 * 列出下面程序所有可能的输出序列:
 * int main() {
 *  if (Fork() == 0) {
 *    printf("a");
 *  } else {
 *    printf("b");
 *    waitpid(-1, NULL, 0);
 *  }
 *  printf("c");
 *  exit(0);
 * }
 *
 * acbc
 * bacc
 * abcc
 *
 */
